; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	thermograph3 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	GroundStation19 - direction
	Star14 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star6 - direction
	Star18 - direction
	GroundStation4 - direction
	Star20 - direction
	Planet21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Planet24 - direction
	Star25 - direction
	Phenomenon26 - direction
	Planet27 - direction
	Star28 - direction
	Phenomenon29 - direction
	Star30 - direction
	Phenomenon31 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star14)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star25)
	(supports instrument1 thermograph3)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star18)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star30)
)
(:goal (and
	(pointing satellite0 GroundStation19)
	(pointing satellite1 GroundStation19)
	(have_image Star20 thermograph0)
	(have_image Planet21 thermograph2)
	(have_image Phenomenon22 thermograph0)
	(have_image Planet23 thermograph3)
	(have_image Planet24 image1)
	(have_image Star25 thermograph2)
	(have_image Phenomenon26 thermograph0)
	(have_image Planet27 thermograph3)
	(have_image Star28 image1)
	(have_image Phenomenon29 thermograph2)
	(have_image Star30 thermograph3)
	(have_image Phenomenon31 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (turn_to satellite1 star6 star30)
   deleted: (pointing satellite1 star30)
   added: (pointing satellite1 star6)
   goals met: 0 of 14
4. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 14
5. (turn_to satellite1 groundstation19 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation19)
   goals met: 1 of 14
6. (turn_to satellite1 phenomenon22 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 phenomenon22)
   goals met: 0 of 14
7. (take_image satellite1 phenomenon22 instrument1 thermograph0)
   added: (have_image phenomenon22 thermograph0)
   goals met: 1 of 14
8. (turn_to satellite1 groundstation19 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 groundstation19)
   goals met: 2 of 14
9. (turn_to satellite1 phenomenon26 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 phenomenon26)
   goals met: 1 of 14
10. (take_image satellite1 phenomenon26 instrument1 thermograph0)
   added: (have_image phenomenon26 thermograph0)
   goals met: 2 of 14
11. (turn_to satellite1 groundstation19 phenomenon26)
   deleted: (pointing satellite1 phenomenon26)
   added: (pointing satellite1 groundstation19)
   goals met: 3 of 14
12. (turn_to satellite1 phenomenon31 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 phenomenon31)
   goals met: 2 of 14
13. (take_image satellite1 phenomenon31 instrument1 image1)
   added: (have_image phenomenon31 image1)
   goals met: 3 of 14
14. (turn_to satellite1 groundstation19 phenomenon31)
   deleted: (pointing satellite1 phenomenon31)
   added: (pointing satellite1 groundstation19)
   goals met: 4 of 14
15. (turn_to satellite1 planet23 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 planet23)
   goals met: 3 of 14
16. (take_image satellite1 planet23 instrument1 thermograph3)
   added: (have_image planet23 thermograph3)
   goals met: 4 of 14
17. (turn_to satellite1 groundstation19 planet23)
   deleted: (pointing satellite1 planet23)
   added: (pointing satellite1 groundstation19)
   goals met: 5 of 14
18. (turn_to satellite1 planet24 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 planet24)
   goals met: 4 of 14
19. (take_image satellite1 planet24 instrument1 image1)
   added: (have_image planet24 image1)
   goals met: 5 of 14
20. (turn_to satellite1 groundstation19 planet24)
   deleted: (pointing satellite1 planet24)
   added: (pointing satellite1 groundstation19)
   goals met: 6 of 14
21. (turn_to satellite1 planet27 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 planet27)
   goals met: 5 of 14
22. (take_image satellite1 planet27 instrument1 thermograph3)
   added: (have_image planet27 thermograph3)
   goals met: 6 of 14
23. (turn_to satellite1 groundstation19 planet27)
   deleted: (pointing satellite1 planet27)
   added: (pointing satellite1 groundstation19)
   goals met: 7 of 14
24. (turn_to satellite1 star20 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 star20)
   goals met: 6 of 14
25. (take_image satellite1 star20 instrument1 thermograph0)
   added: (have_image star20 thermograph0)
   goals met: 7 of 14
26. (turn_to satellite1 groundstation19 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 groundstation19)
   goals met: 8 of 14
27. (turn_to satellite1 star28 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 star28)
   goals met: 7 of 14
28. (take_image satellite1 star28 instrument1 image1)
   added: (have_image star28 image1)
   goals met: 8 of 14
29. (turn_to satellite1 groundstation19 star28)
   deleted: (pointing satellite1 star28)
   added: (pointing satellite1 groundstation19)
   goals met: 9 of 14
30. (turn_to satellite1 star30 groundstation19)
   deleted: (pointing satellite1 groundstation19)
   added: (pointing satellite1 star30)
   goals met: 8 of 14
31. (take_image satellite1 star30 instrument1 thermograph3)
   added: (have_image star30 thermograph3)
   goals met: 9 of 14
32. (turn_to satellite1 groundstation19 star30)
   deleted: (pointing satellite1 star30)
   added: (pointing satellite1 groundstation19)
   goals met: 10 of 14
33. (turn_to satellite0 star14 star25)
   deleted: (pointing satellite0 star25)
   added: (pointing satellite0 star14)
   goals met: 10 of 14
34. (calibrate satellite0 instrument0 star14)
   added: (calibrated instrument0)
   goals met: 10 of 14
35. (turn_to satellite0 groundstation19 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation19)
   goals met: 11 of 14
36. (turn_to satellite0 phenomenon29 groundstation19)
   deleted: (pointing satellite0 groundstation19)
   added: (pointing satellite0 phenomenon29)
   goals met: 10 of 14
37. (take_image satellite0 phenomenon29 instrument0 thermograph2)
   added: (have_image phenomenon29 thermograph2)
   goals met: 11 of 14
38. (turn_to satellite0 groundstation19 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 groundstation19)
   goals met: 12 of 14
39. (turn_to satellite0 planet21 groundstation19)
   deleted: (pointing satellite0 groundstation19)
   added: (pointing satellite0 planet21)
   goals met: 11 of 14
40. (take_image satellite0 planet21 instrument0 thermograph2)
   added: (have_image planet21 thermograph2)
   goals met: 12 of 14
41. (turn_to satellite0 groundstation19 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 groundstation19)
   goals met: 13 of 14
42. (turn_to satellite0 star25 groundstation19)
   deleted: (pointing satellite0 groundstation19)
   added: (pointing satellite0 star25)
   goals met: 12 of 14
43. (take_image satellite0 star25 instrument0 thermograph2)
   added: (have_image star25 thermograph2)
   goals met: 13 of 14
44. (turn_to satellite0 groundstation19 star25)
   deleted: (pointing satellite0 star25)
   added: (pointing satellite0 groundstation19)
   goals met: 14 of 14
